const ru = {
  authorization_mode_tips: `
      <b>Без подписи</b>
      <br />
      Авторизуйтесь один раз и размещайте ордера без подписания.
      <br />
      <br />
      <b>Всегда подписывать</b>
      <br />
      Подписывайте с помощью вашего кошелька для каждой транзакции.
    `,
  service_unavailable_for_blacklist: `
      <div>
        Ваш доступ к DeGate ограничен. Для получения дополнительной информации
        посетите{' '}
        <a
          href="https://discord.com/channels/814731180892487702/1086188643342889020"
          target="_blank"
        >
          сообщество DeGate
        </a>{' '}
        .
      </div>
    `,
  initialization_desc: `
      Вы получите два запроса на подпись. <br />
      Подписывание бесплатно.
    `,

  device_fast: `
      Ваше устройство <br />
      <b>{time} секунд быстрее</b>
    `,
  device_slow: `
      Ваше устройство <br />
      <b>{time} секунд медленнее</b>
    `,
  localTime_tips: `
      Установите настройки времени на вашем устройстве на "Автоматически", чтобы
      протокол DeGate работал правильно.
      <br />
      <b>Пожалуйста, обновите страницу после внесения изменений.</b>
    `,
};

export default ru;
