const ukr = {
  authorization_mode_tips: `
      <b>Без підпису</b>
      <br />
      Авторизуйтесь один раз та розміщуйте ордери без підпису
      <br />
      <br />
      <b>Завжди підписувати</b>
      <br />
      Підписуйте у своєму гаманці кожну транзакцію при розміщенні ордеру
    `,
  service_unavailable_for_blacklist: `
      <div>
        Ваш доступ до DeGate обмежено. Для отримання додаткової інформації
        відвідайте{' '}
        <a
          href="https://discord.com/channels/814731180892487702/1086188643342889020"
          target="_black"
        >
          DeGate спільнота
        </a>{' '}
        .
      </div>
    `,
  initialization_desc: `
      Ви отримаєте два запити на підпис. <br />
      Підпис безкоштовний.
    `,
  device_fast: `
      Ваш пристрій <br />
      <b>{time} секунд швидше</b>
    `,
  device_slow: `
      Ваш пристрій <br />
      <b>{time} секунд повільніше</b>
    `,
  localTime_tips: `
      Встановіть &apos;s налаштування часу на &quot;Автоматично&quot;, щоб
      протокол DeGate працював коректно.
      <br />
      <b>Будь ласка, оновіть сторінку для активації змін.</b>
    `,
};

export default ukr;
