import React from 'react';
import styled from 'styled-components';

export default function IconTimeFast({
  className,
  onClick,
  ...rest
}: {
  className?: string;
  size?: number;
  onClick?: (e?: any) => void;
}) {
  return (
    <StyledSpan
      className={`${className} dg-icon icon-time-fast`}
      onClick={onClick}
      {...rest}
    >
      <svg width="50px" height="50px" viewBox="0 0 50 50">
        <g
          id="popup-time-fast50x50"
          stroke="none"
          strokeWidth="1"
          fill="none"
          fillRule="evenodd"
        >
          <g id="time-fast" fill="#FEBE2F" fillRule="nonzero">
            <path
              d="M25,50 C11.25,50 0,38.75 0,25 C0,11.25 11.25,0 25,0 C38.75,0 50,11.25 50,25 C50,25.9375 49.375,26.5625 48.4375,26.5625 C47.5,26.5625 46.875,25.9375 46.875,25 C46.875,12.8125 37.1875,3.125 25,3.125 C12.8125,3.125 3.125,12.8125 3.125,25 C3.125,37.1875 12.8125,46.875 25,46.875 C25.9375,46.875 26.5625,47.5 26.5625,48.4375 C26.5625,49.375 25.9375,50 25,50 Z"
              id="路径"
              opacity="0.2"
              transform="translate(25, 25) scale(-1, 1) rotate(90) translate(-25, -25)"
            ></path>
            <g id="编组-2" transform="translate(32, 33)" opacity="0.8">
              <path
                d="M5.22701315,4.76977863 L11.4070778,11.3133765 C11.7862895,11.7148947 11.7682064,12.3478014 11.3666882,12.7270132 C11.1810581,12.9023304 10.935397,13 10.6800646,13 L-1.68006462,13 C-2.23234937,13 -2.68006462,12.5522847 -2.68006462,12 C-2.68006462,11.7446676 -2.58239503,11.4990065 -2.40707777,11.3133765 L3.77298685,4.76977863 C4.15219855,4.36826036 4.78510526,4.35017731 5.18662353,4.72938901 C5.20046858,4.74246489 5.21393728,4.75593359 5.22701315,4.76977863 Z"
                id="三角形"
                transform="translate(4.5, 8.5) rotate(90) translate(-4.5, -8.5)"
              ></path>
              <path
                d="M14.2270132,4.76977863 L20.4070778,11.3133765 C20.7862895,11.7148947 20.7682064,12.3478014 20.3666882,12.7270132 C20.1810581,12.9023304 19.935397,13 19.6800646,13 L7.31993538,13 C6.76765063,13 6.31993538,12.5522847 6.31993538,12 C6.31993538,11.7446676 6.41760497,11.4990065 6.59292223,11.3133765 L12.7729868,4.76977863 C13.1521986,4.36826036 13.7851053,4.35017731 14.1866235,4.72938901 C14.2004686,4.74246489 14.2139373,4.75593359 14.2270132,4.76977863 Z"
                id="三角形"
                transform="translate(13.5, 8.5) rotate(90) translate(-13.5, -8.5)"
              ></path>
            </g>
            <g id="编组" transform="translate(13, 12)" opacity="0.8">
              <path
                d="M1.5,16 C0.671572875,16 0,15.3284271 0,14.5 C0,13.6715729 0.671572875,13 1.5,13 L10,13 L10,1.5 C10,0.671572875 10.6715729,1.52179594e-16 11.5,0 C12.3284271,-1.52179594e-16 13,0.671572875 13,1.5 L13,14.5 C13,15.2796961 12.4051119,15.9204487 11.64446,15.9931334 L11.5,16 L1.5,16 Z"
                id="矩形-2"
              ></path>
            </g>
          </g>
        </g>
      </svg>
    </StyledSpan>
  );
}

const StyledSpan = styled.span`
  text-rendering: optimizelegibility;
  color: inherit;
  display: inline-block;
  font-style: normal;
  line-height: 0;
  text-align: center;
  text-transform: none;
`;
